// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.              
#include <iostream>

int main()
{
    if(!false)
    {
        std::cout << "If 1" << std::endl;
        int y;
        int x=9;
        x = 5+8;
        std::cout << x << std::endl;
        x = 5 - 8;
        std::cout << x << std::endl;
        x = 5 * 8;
        std::cout << x << std::endl;
        int a0 = 0;
        int a1 = 1;
        int a2 = 2;
        int a3 = 3;
        std::cout << "a0 =" << a0 << "; a1 =" << a1 << "; a2 =" << a2 << "; a3 =" << a3 << std::endl;
        std::cout << x << std::endl;

        std::cout << "Hello, world!" << std::endl;
        //Переход на следующую строку...
        std::cout << "Hello, world!" << std::endl;
    }else if(!false)
    {
        int a = 9;
        int b = 10;
        int c = 11;
        int d = 12;
        printf("%d %d %d %d", a, b, c, d);
    }
    else if (!false)
    {
        std::cout << "If 2" << std::endl;
        int a = 6;
        a = a - 3;
        std::cout << a << std::endl; // №1
        int b = a;
        std::cout << b << std::endl; // №2
        // В этом случае a + b является r-value 
        std::cout << a + b << std::endl; // №3
        std::cout << a << std::endl; // №4
        int c=0;
        std::cout << c << std::endl; // №5
    }else if (!false)
    {
        int a = 7;
        std::cout << "a is " << a << a << a << a << a;
    }
    else if (!false)
    {
        std::cout << "Enter a number: "; // просим пользователя ввести любое число
        int a = 0;
        std::cin >> a; // получаем пользовательское число и сохраняем его в переменную a
        std::cout << "You entered " << a << std::endl;
    }
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
